In [1]:
import pandas as pd

# Task 1

In [4]:
#Create dataframe from dictionary
data = {'Name': ['John', 'Anna', 'Peter', 'Linda'],'age':[23, 36, 32, 45],'city':['New York', 'Paris', 'Berlin', 'London']}
df = pd.DataFrame(data)
print(df)

    Name  age      city
0   John   23  New York
1   Anna   36     Paris
2  Peter   32    Berlin
3  Linda   45    London

In [12]:
# create a dataframe from list of dictionaries
data1 = [
    {"name": "Alice", "age": 25, "city": "New York"},
    {"name": "Bob", "age": 30, "city": "Los Angeles"},
    {"name": "Charlie", "age": 35, "city": "Chicago"}
]
df = pd.DataFrame(data1)
print(df)

      name  age         city
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [14]:
# Load the dataset
df = pd.read_csv('messed_dataset.csv')
print(df.head())

                Name   Age                Email      Country    Salary  \
0            invalid  59.0  ycastro@example.org  Switzerland  44694.24
1    David Jefferson  21.0                  NaN        China       NaN
2      Jessica Reyes  34.0                  NaN          NaN  60511.62
3  Kenneth Macdonald  68.0    ewolf@example.com        Italy  84223.29
4        Julie Horne  78.0                  NaN      Ecuador  24665.13

  DateOfJoining
0    2022-09-29
1    2021-10-04
2    2022-05-24
3    2022-04-07
4    2020-06-19

# Task 2

- Basic Data Cleaning

In [5]:
# Your code goes here

In [15]:
# Display the first and last few rows of the DataFrame.
print(df.head())
print(df.tail())

                Name   Age                Email      Country    Salary  \
0            invalid  59.0  ycastro@example.org  Switzerland  44694.24
1    David Jefferson  21.0                  NaN        China       NaN
2      Jessica Reyes  34.0                  NaN          NaN  60511.62
3  Kenneth Macdonald  68.0    ewolf@example.com        Italy  84223.29
4        Julie Horne  78.0                  NaN      Ecuador  24665.13

  DateOfJoining
0    2022-09-29
1    2021-10-04
2    2022-05-24
3    2022-04-07
4    2020-06-19
                  Name   Age                     Email            Country  \
95    Garrett Davidson  56.0        gjames@example.com    Solomon Islands
96      Elizabeth Ross  52.0  richardlewis@example.net  Equatorial Guinea
97                 NaN  72.0       brian50@example.com            Somalia
98      Patricia Singh  65.0      lramirez@example.org             Greece
99  Christopher Stokes  42.0                       NaN       South Africa

      Salary DateOfJoining
95  86227.88           NaN
96  29992.69    2020-04-08
97  90628.22    2020-04-11
98  85290.44    2020-03-18
99  20289.17    2021-09-23

In [16]:
# Get a summary of the DataFrame, including basic statistics and data types.

print(df.info())
print(df.describe())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Name           89 non-null     object
 1   Age            97 non-null     object
 2   Email          80 non-null     object
 3   Country        86 non-null     object
 4   Salary         94 non-null     object
 5   DateOfJoining  79 non-null     object
dtypes: object(6)
memory usage: 4.8+ KB
None
           Name   Age                Email Country   Salary DateOfJoining
count        89    97                   80      86       94            79
unique       85    53                   80      76       93            79
top     invalid  76.0  ycastro@example.org   China  invalid    2022-09-29
freq          5     6                    1       2        2             1

In [17]:
# Display the shape and column names of the DataFrame.
print(df.shape)
print(df.columns)

(100, 6)
Index(['Name', 'Age', 'Email', 'Country', 'Salary', 'DateOfJoining'], dtype='object')

# Task 3
- Data Analysis. Analyse the data by giving the summary statistics, and more information about the data

In [20]:
# Your code goes here

# Select a single column and multiple columns.
print(df['Name'])
print(df[['Name', 'Age']])

0                invalid
1        David Jefferson
2          Jessica Reyes
3      Kenneth Macdonald
4            Julie Horne
             ...
95      Garrett Davidson
96        Elizabeth Ross
97                   NaN
98        Patricia Singh
99    Christopher Stokes
Name: Name, Length: 100, dtype: object
                  Name   Age
0              invalid  59.0
1      David Jefferson  21.0
2        Jessica Reyes  34.0
3    Kenneth Macdonald  68.0
4          Julie Horne  78.0
..                 ...   ...
95    Garrett Davidson  56.0
96      Elizabeth Ross  52.0
97                 NaN  72.0
98      Patricia Singh  65.0
99  Christopher Stokes  42.0

[100 rows x 2 columns]

In [25]:
# Select rows by index and by label.
print(df.iloc[0]) # Select the first row
print(df.loc[5])    # Select the row with index 5

print(df.loc[[0, 1, 2]])    # Select multiple rows by label

Name                         invalid
Age                             59.0
Email            ycastro@example.org
Country                  Switzerland
Salary                      44694.24
DateOfJoining             2022-09-29
Name: 0, dtype: object
Name                     Jonathan Holland
Age                                  26.0
Email            mayercaitlin@example.org
Country                          Cameroon
Salary                           25660.99
DateOfJoining                  2023-05-01
Name: 5, dtype: object
              Name   Age                Email      Country    Salary  \
0          invalid  59.0  ycastro@example.org  Switzerland  44694.24
1  David Jefferson  21.0                  NaN        China       NaN
2    Jessica Reyes  34.0                  NaN          NaN  60511.62

  DateOfJoining
0    2022-09-29
1    2021-10-04
2    2022-05-24

# Task 4
- Handling Missing Data

In [32]:
# Identify missing values in the DataFrame.
print(df.isnull().sum())
# Identify missing values in the DataFrame.
print(df[df.isnull().any(axis=1)])

Name             11
Age               3
Email            20
Country          14
Salary            6
DateOfJoining    21
dtype: int64
                  Name   Age                        Email  \
1      David Jefferson  21.0                          NaN
2        Jessica Reyes  34.0                          NaN
4          Julie Horne  78.0                          NaN
6          James Clark  80.0          ynguyen@example.net
8    Barbara Armstrong  22.0        fmitchell@example.com
11        Keith Deleon  56.0       josephwall@example.com
12       Kelly Schultz  21.0                          NaN
14         James Lloyd  53.0                          NaN
16                 NaN  73.0   johnstonkrista@example.com
17                 NaN   NaN          julia08@example.com
18          Greg Gates  77.0                          NaN
19            Amy Sims  31.0                          NaN
21         Mark Barber  60.0        davidcook@example.net
22          John Hicks  30.0          catkins@example.org
25                 NaN  20.0                          NaN
26                 NaN  59.0            amy02@example.net
27                 NaN  71.0  gillespiecalvin@example.net
30      Raven Thompson  77.0     brandibarnes@example.com
31        William Peck  26.0    christopher37@example.org
32                 NaN  57.0    danielperkins@example.org
33          Laura Pham  69.0                          NaN
34       David Shields  55.0           brad93@example.net
38        Lindsey York  38.0                          NaN
39        Lauren Ramos  80.0         tracey07@example.net
41        Nichole Mora  52.0      turnersarah@example.net
42      Calvin Herrera  21.0                          NaN
45     Melanie Buckley  35.0                          NaN
46    Marissa Williams  18.0                          NaN
47       Matthew Stone   NaN     jessicamoody@example.com
48     Charles Sanchez  28.0     jenkinsmaria@example.net
50                 NaN  33.0      robertsmith@example.net
53     Kristin Stewart  70.0                          NaN
54           Julie Kim  77.0          rmorgan@example.net
55      James Williams  69.0                          NaN
56        Melissa Cook  51.0   thompsonhunter@example.org
57             invalid  19.0                          NaN
62                 NaN  24.0        katelyn76@example.net
63     Wesley Whitaker  47.0                          NaN
65                 NaN  68.0       guyjohnson@example.com
66        Karen Peters  58.0         ricelisa@example.net
67                 NaN  47.0      stephanie20@example.net
71        Chase Parker  27.0                          NaN
75             invalid   NaN       ericnguyen@example.com
76     Angela Thompson  73.0   petersonshelby@example.org
77       Phillip Garza  49.0     brandimclean@example.org
79    Shannon Gonzalez  22.0           jean37@example.net
90             invalid  43.0                          NaN
95    Garrett Davidson  56.0           gjames@example.com
97                 NaN  72.0          brian50@example.com
99  Christopher Stokes  42.0                          NaN

                                              Country    Salary DateOfJoining
1                                               China       NaN    2021-10-04
2                                                 NaN  60511.62    2022-05-24
4                                             Ecuador  24665.13    2020-06-19
6                                                 NaN  61345.33           NaN
8                                                 NaN       NaN           NaN
11                            Cocos (Keeling) Islands  23361.13           NaN
12                                           Kiribati  93448.73    2023-07-24
14                                                NaN       NaN           NaN
16                                       Cook Islands  24176.12    2022-10-11
17                                          Venezuela  93339.52    2020-11-11
18                                                NaN  54383.22    2024-05-13
19                                            Bolivia  51559.83    2023-08-22
21                                                NaN  96746.83    2021-02-27
22                                             Mexico  80906.51           NaN
25                          Bouvet Island (Bouvetoya)  73892.64    2023-08-26
26                                           Anguilla  56583.58           NaN
27                               Syrian Arab Republic  71049.67    2020-01-20
30                                              Korea  76460.86           NaN
31                                                NaN  42155.66           NaN
32                                           Barbados  78620.54    2024-05-17
33                                             Israel  45046.19    2024-04-01
34                                            Burundi       NaN    2023-11-27
38                                             Mexico  97896.77    2022-03-05
39                                             Zambia  74110.67           NaN
41                                             Angola  64674.33           NaN
42                                              China  50975.46           NaN
45                                               Mali  78258.04           NaN
46                                                NaN  46658.98    2020-07-14
47                                                NaN  28874.43    2020-07-06
48                                              Chile       NaN           NaN
50                                            Nigeria  99405.51           NaN
53                                                NaN   73952.9    2021-09-06
54                                                NaN   46532.6    2021-03-07
55                                            Lesotho  84632.67           NaN
56                                                NaN  52040.14    2022-04-04
57                                                NaN  36728.76    2021-04-22
62                                              Yemen  61256.89    2020-01-06
63  British Indian Ocean Territory (Chagos Archipe...  97832.79    2020-12-20
65                                              Sudan  80279.35    2022-10-21
66                                              Yemen  36736.59           NaN
67                                              Macao  36365.55           NaN
71                                            Belgium   28097.5           NaN
75                                Trinidad and Tobago  49670.61    2020-11-22
76                                            Albania       NaN    2023-05-09
77                                            Georgia  34326.41           NaN
79                                                NaN  64831.97           NaN
90                                          Indonesia   41928.2    2020-05-08
95                                    Solomon Islands  86227.88           NaN
97                                            Somalia  90628.22    2020-04-11
99                                       South Africa  20289.17    2021-09-23

# Data Visualization
- Visualize the data by using the visualization libraries

In [7]:
# Your code goes here